cf/Reports/KPI_Закупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>KPI_Закупки</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПродажаВРозницу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПродажи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Акция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/InformationRegisters/РабочиеДни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РабочиеДни</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выходной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/КлассификацияАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>КлассификацияАнализа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажиШт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажиСумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажиСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиШт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаткиСебестоимость</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/СпособРасчетаABC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособРасчетаABC</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПарето</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМетодуКасательной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ГруппыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГруппыСкладов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлассифицироватьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Reports/KPI_Закупки/Ext/ObjectModule.bsl
Функция КомпоновщикНастроекУстановитьПараметр(КомпоновщикНастроек, ИмяПараметра, Значение)
	НекийПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
   
	Если НекийПараметр = Неопределено Тогда
		НекийПараметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Добавить();
		НекийПараметр.Параметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	КонецЕсли;
	
	НекийПараметр.Использование = Истина;
	НекийПараметр.Значение = Значение;
КонецФункции
Функция ПолучитьТаблицуABC(Период, Склады = Неопределено, A, B, КатегорияТовара = Неопределено, Бренд = Неопределено)
		
	УстановитьПривилегированныйРежим(Истина);
	
	Схема = Отчеты.ABCАнализНоменклатурыДинамичесий.ПолучитьМакет("СхемаПодбора");

//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
//	ТаблицаЗначений = Новый ТаблицаЗначений;
//		
//	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, КомпановщикПодбора.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
//	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
//	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
//	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
/////
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = Схема.НастройкиПоУмолчанию;
	//Если Настройки = Неопределено Тогда Настройки = КомпоновщикОтчета.Настройки КонецЕсли;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	        
	// Загрузим пользовтельские настройки которые ввыел пользователь совсем недавно
	КомпНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпНастроек.ЗагрузитьНастройки(Настройки);
	//КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикОтчета.ПользовательскиеНастройки);
	
	КомпоновщикНастроекУстановитьПараметр(КомпНастроек, "ПериодРасчета"		, Период);
	КомпоновщикНастроекУстановитьПараметр(КомпНастроек, "ТипЦен", Константы.ТипЦенСебестоимостьДляРасчетаЗП.Получить());
	КомпоновщикНастроекУстановитьПараметр(КомпНастроек, "ТипЦен1", Константы.ТипЦенЗакупочныйРуб.Получить());
	Если Склады <> НЕОПРЕДЕЛЕНО ТОГДА
		КомпоновщикНастроекУстановитьПараметр(КомпНастроек, "Склады"	,Склады); КонецЕсли;
	
	Для каждого элементОтбора Из КомпНастроек.Настройки.Отбор.Элементы Цикл
		Если элементОтбора.Представление = "КатегорияТовара" И КатегорияТовара <> Неопределено Тогда
			элементОтбора.ПравоеЗначение = КатегорияТовара; 
			элементОтбора.Использование = Истина;
		ИначеЕсли
			элементОтбора.Представление = "Бренд" И Бренд <> Неопределено Тогда
			элементОтбора.ПравоеЗначение = Бренд; 
			элементОтбора.Использование = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, КомпНастроек.ПолучитьНастройки(),,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	              
	//Очищаем поле табличного документа
	Результат = Новый ТаблицаЗначений;
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	УстановитьПривилегированныйРежим(Ложь);
	
	ABCXYZАнализ.ОпределитьКатегорииABC(Результат,Перечисления.КлассификацияАнализа.Прибыль, Перечисления.СпособРасчетаABC.ПоПарето, A, B);
	
	Возврат Результат;

КонецФункции
Функция ПолучитьТаблицуГодовыхПродаж(ДатаНачала, ДатаОкончания, Склады = Неопределено, ГруппыСкладов = Неопределено, КатегорияТовара = Неопределено, Бренд = Неопределено)
	
	Условие = ?(Склады = Неопределено, "", " Склад В (&Склады) ");
	Условие = Условие + ?(ГруппыСкладов = Неопределено, "", ?(ПустаяСтрока(Условие), "", " И ") + " Склад В (ВЫБРАТЬ Склад ИЗ Справочник.ГруппыСкладов.Склады ГДЕ Ссылка В (&ГруппыСкладов)) ");
	Условие = Условие + ?(КатегорияТовара = Неопределено, "", ?(ПустаяСтрока(Условие), "", " И ") + " Номенклатура.КатегорияТовара = &КатегорияТовара ");
	Условие = Условие + ?(Бренд = Неопределено, "", ?(ПустаяСтрока(Условие), "", " И ") + " Номенклатура.Производитель = &Бренд ");
	
	Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура, КоличествоОборот КАК ГодовыеПродажи, КоличествоОборот/12 КАК СредниеГодовыеПродажи 
	|ИЗ РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода,,"  + Условие + ")");
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("ГруппыСкладов", ГруппыСкладов);
	Запрос.УстановитьПараметр("КатегорияТовара", КатегорияТовара);
	Запрос.УстановитьПараметр("Бренд", Бренд);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуСреднихПродажПомесячно(НачалоПериода, КонецПериода, Склады = Неопределено, ГруппыСкладов = Неопределено, КатегорияТовара = Неопределено, Бренд = Неопределено)
	
	// разбиваем период на месяца
	Запрос = Новый Запрос("ВЫБРАТЬ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) НачалоПериода ИЗ РегистрСведений.РабочиеДни ГДЕ Дата МЕЖДУ &НачалоПериода И &КонецПериода СГРУППИРОВАТЬ ПО НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ)");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРезультат.Колонки.Добавить("ГодовыеПродажи", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("СредниеГодовыеПродажи", Новый ОписаниеТипов("Число"));
	ТаблицаРезультат.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Пока Выборка.Следующий() Цикл
		Таблица = ПолучитьТаблицуГодовыхПродаж(ДобавитьМесяц(Выборка.НачалоПериода, -12), Выборка.НачалоПериода, Склады, ГруппыСкладов, КатегорияТовара, Бренд);
	   	Таблица.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
		Таблица.ЗаполнитьЗначения(Выборка.НачалоПериода, "Период");
		КонвертацияТипов.ДобавитьТаблицуКДругойТаблице(ТаблицаРезультат, Таблица);
	КонецЦикла;

	Возврат ТаблицаРезультат;
	
КонецФункции


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Параметры = КомпоновщикНастроек.ПользовательскиеНастройки;

	Склады = Неопределено; A = 80; B = 15; КатегорияТовара = Неопределено; Бренд = Неопределено;
	ГруппыСкладов = Неопределено;
	
	Для Каждого Элемент ИЗ Параметры.Элементы Цикл
		
		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("Период") И Элемент.Использование Тогда
	    	ЗначениеПериод = Элемент.Значение;
		КонецЕсли;

		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("НачалоПериода") И Элемент.Использование Тогда
	    	ЗначениеНачалоПериода = Элемент.Значение;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("КонецПериода") И Элемент.Использование Тогда
	    	ЗначениеКонецПериода = Элемент.Значение;
		КонецЕсли;	
		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("A") И Элемент.Использование Тогда
	    	A = Элемент.Значение;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("B") И Элемент.Использование Тогда
	    	B = Элемент.Значение;
		КонецЕсли;	
		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("Склады") И Элемент.Использование Тогда
	    	Склады = Элемент.Значение;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Элемент.Параметр = Новый ПараметрКомпоновкиДанных("ГруппыСкладов") И Элемент.Использование Тогда
	    	ГруппыСкладов = Элемент.Значение;
		КонецЕсли;
		
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("СправочникСсылка.КатегорииТоваров") И Элемент.Использование Тогда
			КатегорияТовара = Элемент.ПравоеЗначение; КонецЕсли;
		КонецЕсли;	
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("СправочникСсылка.Производители") И Элемент.Использование Тогда
			Бренд = Элемент.ПравоеЗначение; КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки, ,); //Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаABC", ПолучитьТаблицуABC(ЗначениеПериод, Склады, A, B, КатегорияТовара, Бренд));
	ВнешниеНаборыДанных.Вставить("ГодовыеПродажи", ПолучитьТаблицуСреднихПродажПомесячно(ЗначениеПериод.ДатаНачала, ЗначениеПериод.ДатаОкончания, Склады, ГруппыСкладов, КатегорияТовара, Бренд));
	
	//Компоновка данных 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	//Вывод результата 
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	
	////Выводим результат в табличный документ
	//Результат = Новый ТаблицаЗначений;

	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//ПроцессорВывода.УстановитьОбъект(Результат);

	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//а = 1;
КонецПроцедуры
